study/apiauto/reports/jmeter.log
2022-09-07 19:01:53,773 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2022-09-07 19:01:53,789 INFO o.a.j.JMeter: Loading user properties from: C:\Users\admin\Desktop\软件测试\jmeter\apache-jmeter-5.4.3\apache-jmeter-5.4.3\bin\user.properties
2022-09-07 19:01:53,791 INFO o.a.j.JMeter: Loading system properties from: C:\Users\admin\Desktop\软件测试\jmeter\apache-jmeter-5.4.3\apache-jmeter-5.4.3\bin\system.properties
2022-09-07 19:01:53,806 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2022-09-07 19:01:53,807 INFO o.a.j.JMeter: Version 5.4.3
2022-09-07 19:01:53,807 INFO o.a.j.JMeter: java.version=1.8.0_111
2022-09-07 19:01:53,807 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: os.name=Windows 7
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: os.arch=amd64
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: os.version=6.1
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: file.encoding=GBK
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: java.awt.headless=true
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: Max memory     =1073741824
2022-09-07 19:01:53,808 INFO o.a.j.JMeter: Available Processors =2
2022-09-07 19:01:53,816 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-09-07 19:01:53,816 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2022-09-07 19:01:53,816 INFO o.a.j.JMeter: JMeterHome=C:\Users\admin\Desktop\软件测试\jmeter\apache-jmeter-5.4.3\apache-jmeter-5.4.3
2022-09-07 19:01:53,816 INFO o.a.j.JMeter: user.dir  =C:\Users\admin\Desktop\Git\api\reports
2022-09-07 19:01:53,817 INFO o.a.j.JMeter: PWD       =C:\Users\admin\Desktop\Git\api\reports
2022-09-07 19:01:53,837 INFO o.a.j.JMeter: IP: 169.254.128.82 Name: stu7753f5 FullName: stu7753f5
2022-09-07 19:01:53,845 INFO o.a.j.s.FileServer: Default base='C:\Users\admin\Desktop\Git\api\reports'
2022-09-07 19:01:53,846 INFO o.a.j.s.FileServer: Set new base='C:\Users\admin\Desktop\Git\api\reports\..'
2022-09-07 19:01:54,013 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-09-07 19:01:54,028 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-09-07 19:01:54,034 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-09-07 19:01:54,039 INFO o.a.j.s.SaveService: Loading file: ..\seafile_jmeter.jmx
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-09-07 19:01:54,131 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-09-07 19:01:54,211 INFO o.a.j.JMeter: Creating summariser <summary>
2022-09-07 19:01:54,216 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-09-07 19:01:54,218 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-09-07 19:01:54,218 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-09-07 19:01:54,222 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-09-07 19:01:54,222 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-09-07 19:01:54,694 INFO o.a.j.JMeter: 正在运行的测试 (1662548514694)
2022-09-07 19:01:54,780 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2022-09-07 19:01:54,781 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group 线程组.
2022-09-07 19:01:54,781 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-09-07 19:01:54,781 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=1 delayedStart=false
2022-09-07 19:01:54,790 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-09-07 19:01:54,790 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-09-07 19:01:54,870 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-1
2022-09-07 19:01:54,873 INFO o.a.j.s.FileServer: Stored: C:/jiekou/data.csv
2022-09-07 19:01:54,905 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = stu7753f5
2022-09-07 19:01:54,913 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-09-07 19:01:54,914 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-09-07 19:01:54,914 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-09-07 19:01:54,915 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-09-07 19:01:54,915 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-09-07 19:01:55,187 INFO o.a.j.t.JMeterThread: Thread is done: 线程组 1-1
2022-09-07 19:01:55,187 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-1
2022-09-07 19:01:55,201 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-2
2022-09-07 19:01:55,314 INFO o.a.j.t.JMeterThread: Thread is done: 线程组 1-2
2022-09-07 19:01:55,315 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-2
2022-09-07 19:01:55,528 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-3
2022-09-07 19:01:55,622 INFO o.a.j.t.JMeterThread: Thread is done: 线程组 1-3
2022-09-07 19:01:55,623 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-3
2022-09-07 19:01:55,625 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2022-09-07 19:01:55,626 INFO o.a.j.s.FileServer: Close: C:/jiekou/data.csv
2022-09-07 19:01:55,628 INFO o.a.j.r.Summariser: summary =      6 in 00:00:01 =    6.4/s Avg:    55 Min:    22 Max:   114 Err:     0 (0.00%)